{"pages":[{"url":"http://phil101.colinmclear.net/contact","text":"Dr. Colin McLear Office: 1003 Oldfather Hall Office Hours: M/W 1:30-2:30pm Email: mclear@unl.edu Kevin Patton ( TA ) Office: 1022 Oldfather Hall Office Hours: M/W 11:30-12:30 Email: fregespuzzle@gmail.com Email is the best way to reach me. I answer emails on weekdays, usually within 24 hrs. Students, please check your syllabus before emailing your question. If it is covered in the syllabus, I likely won't respond. If you would like a response, please adhere to these basic email etiquette guidelines: Remember to include your full name and course/section. Use a professional email address, such as your UNL email account, to send email, instead of an anonymous internet account. Using a UNL account also reduces the likelihood that your email will be mistaken for spam. Include an informative subject line that summarizes the content of your email (e.g. \"Question about Assignment 3 for PHIL101 ″ instead of \"Question\"). Begin your email with an appropriate greeting (Dear/Hi/Hello [professor's name]). Keep the body of your email brief and to the point. If it's longer than a paragraph, consider arranging a meeting during office hours to discuss your issue instead. Are you emailing with a question a classmate could answer (about material missed when absent, for example)? If so, ask that classmate before contacting your professor. It's more efficient for everyone. Do not send personal/confidential information in an email; email is not secure. Keep your tone professional. Write in complete sentences and avoid text-speak. Note: If your email looks like this: \"hi prof r we doing anything important 2day? kthxbai!\" you are unlikely to receive a reply. End your email with a closing (Best/Thank you/Sincerely/etc.) and your first and last name. Remember to leave time to receive a response. Do not expect a reply over the weekend or at 3 am, for example. Learning to communicate professionally is a critical skill that will help you in your future job searches and careers. Now is a good time to start practicing!","tags":"pages","title":"Contact"},{"url":"http://phil101.colinmclear.net/phil101.colinmclear.net","text":"This is the homepage for PHIL 101 — Introduction to Philosophy. The subject matter of philosophy traditionally concerns the articulation of \"big\" questions such as, \"Can we know anything?\"; \"What is real?\"; \"What kinds of things exist?\". Philosophers use rigorous and disciplined methods of thinking, in the hopes of bringing such questions under intellectual control. This course provides an in-depth look at a few specific topics, rather than a comprehensive survey of the field and its history. You will learn what philosophy is all about and how to do it yourself. If you'd like to take a look at the syllabus you can find it here: HTML | PDF","tags":"pages","title":"Welcome!"},{"url":"http://phil101.colinmclear.net/papers","text":"WRITE approximately 3-5 double-spaced pages on one of the following topics. For whatever topic you pick you must write it according to the format detailed below. The DUE DATE for the papers is: Friday, December 2 . If you need an extra week, you may hand in the paper (via blackboard) by Friday, December 9. Paper Structure EXPLAIN the argument (what are the premises? what is the conclusion?). You may present the argument in numbered form if you wish, though if you do so be sure to show the connection between the argument as you've explained it and the relevant text(s). ASSESS the argument for validity and soundness and explain why it is/isn't valid/sound. If there are problematic premises, then EXPLAIN how the author defends them. Is the argument for the conclusion CONVINCING ? WHY or why NOT ? For any topic you are free to draw on any concepts or readings we have discussed thus far, but be sure to answer the questions raised by the prompt. I expect papers to be clear . Write in short and complete sentences. Where necessary, sacrifice elegance in favor of clarity. Signpost heavily. Avoid needless generality or autobiographical reportage. Be sure to appropriately cite any sources which you consult in the writing of your paper. This includes sources which you do not directly quote! For further questions please consult the grading rubric . Be sure to review the linked guidelines on writing a thesis statement and paper structure ! Paper Topics In \"What is it like to be a bat\" Thomas Nagel argues that the nature of consciousness presents a challenge to our understanding of physicalism. What is Nagel's argument? What is the significance for physicalism of a \"point of view\" as Nagel understands it? Is Nagel's argument convincing? Why or why not? Explain the Knowledge Argument. What problem does it present for physicalism? What is the basic structure of Lewis's reply? Is his reply convincing? Provide reasons why or why not. Explain the free will problem. Why might free will and determinism be incompatible? What, if any reason do we have to think that they are compatible? Defend your position by providing reasons why or why not. Mackie argues that there are no objective values. Explain his arguments. Are they convincing? Provide reasons why or why not.","tags":"pages","title":"Paper Topics"},{"url":"http://phil101.colinmclear.net/resources","text":"Reading & Writing Philosophy Jim Pryor's guides to reading and writing philosophy Purdue Online Writing Lab A Guide to Philosophical Writing Writing a Thesis Statement Philosophy Paper Structure Philosophical Concepts & Background Critical Thinking Stanford Encyclopedia of Philosophy Internet Encyclopedia of Philosophy Philosophical Terms & Methods Other Materials iClicker registration REEF Polling Quickstart Guide REEF Troubleshooting Guide REEF Ovierview Video","tags":"pages","title":"Resources"},{"url":"http://phil101.colinmclear.net/schedule","text":"Week Date Topic 1 8/22 What is philosophy?; Intro to Logic 8/24 Logic & Argument 2 8/29 Physicalism & Consciousness 8/31 Nagel's Argument 3 9/5 Labor Day (No Class) 9/7 The Knowledge Argument 4 9/12 Lewis against the Knowledge Argument 9/14 The Function of Consciousness 5 9/19 The Function of Consciousness (continued) 9/21 The Puzzle of Representation 6 9/26 Catch-up 9/28 Can Machines Think? 7 10/3 The Chinese Room Argument 10/5 Objections to the Chinese Room Argument 8 10/10 Mid-Term Review 10/12 Mid-Term 9 10/17 Fall Break (No Class) 10/19 Freedom & Determinism 10 10/24 Freedom & Alternate Possibilities 10/26 Determinism & Moral Responsibility 11 10/31 Determinism & Moral Responsibility (continued) 11/2 Free Will & Neuroscience 12 11/7 Free Will & Legal Responsibility 11/9 No Class 13 11/14 Ethics & Meta-Ethics 11/16 Two Kinds of Moral Skepticism 14 11/21 Moral Skepticism (continued) 11/23 Student Holiday (No Class) 15 11/28 The Meaning of Life & Absurdity 11/30 The Absurd (continued); 16 12/5 Meaning of Life (continued); Papers due Friday 12/7 Exam Review 17 12/16 Final Exam 10:00 to 12:00 noon","tags":"pages","title":"Schedule"},{"url":"http://phil101.colinmclear.net/wolf-meaning.html","text":"In our final class on the meaning of life we'll discuss Professor Susan Wolf's lecture \"Meaning in Life.\" Unlike Camus and Nagel, Wolf argues that life has meaning, and attempts to give a particular positive conception of what that meaning consists in. We'll discuss her proposal as well as some potential objections. Readings Wolff, Meaning in Life Videos Meaning in Life Interview with Susan Wolf Professor Wolf discusses her views on the meaning of life at approx 1:33:02.","tags":"assignments","title":"Class 26 - Wolf on Meaning in Life"},{"url":"http://phil101.colinmclear.net/nagel-absurd.html","text":"Today we'll continue looking at the question of the meaning of life and its possible absurdity. We'll look at how Tom Nagel addresses some of the issues raised by Camus, as well as his positive view concerning the absurdity of existence. Today's slides can be found here . Readings Nagel, The Absurd Reading Questions What does Nagel think of the \"standard\" arguments for the absurdity of life? Why does Nagel think life is absurd? How does Nagel think we should act given the absurdity of life?","tags":"assignments","title":"Class 25 - Nagel on the Absurd"},{"url":"http://phil101.colinmclear.net/camus-absurd.html","text":"Today we'll start discussion of our final topic—the meaning of life. We begin by looking at Camus's famous discussion of meaning and the absurd. The questions Camus raises concern potentially sensitive matters, such as death and suicide. These are uncomfortable topics for many and have touched most of us directly or indirectly. But they also raise core philosophical questions, perhaps some of the most important questions in philosophy. We'll look at a few different ways of understanding the question of life's meaning, and what a satisfactory answer (if any be forthcoming) might look like. You see today's slides here . Readings Camus, The Myth of Sisyphus (excerpts) Reading Questions What is, according to Camus, the most important philosophical question? What is \"philosophical suicide\"? What exactly does Camus think is absurd about human existence? Describe Camus's conception of the \"absurd man\". How does the absurd man cope with the absurdity of existence?","tags":"assignments","title":"Class 24 - Camus on the Absurd"},{"url":"http://phil101.colinmclear.net/queerness.html","text":"Today we'll finish up our discussion of Mackie's metaethical skepticism by looking at his \"Argument from Queerness\" concerning what he takes to be the peculiar strangeness of objective moral value. You can find today's slides here . Readings Mackie, \"The Subjectivity of Value\" Read §9, especially (pp. 76-79)","tags":"assignments","title":"Class 23 - Mackie's Error Theory ( II )"},{"url":"http://phil101.colinmclear.net/error-theory.html","text":"Today we look at the details of Mackie's meta-ethical \"error theory\". In particular we'll look at his two central argument concerning the \"queerness\" or strangeness of objective moral properties, were they to exist, and the argument from disagreement. Slides from today can be found here . Readings Mackie, \"The Subjectivity of Value\" Read §§4-9 especially (pp. 62-79) Reading Questions What, according to Mackie, is characteristic of objectivity in ethics? What is Mackie's argument against noncognitivism? What is the argument from disagreement? What is the argument from ‘queerness'?","tags":"assignments","title":"Class 22 - Mackie's Error Theory"},{"url":"http://phil101.colinmclear.net/ethics.html","text":"Today we start our discussion of ethics, and in particular, the issue of what ethical thought and talk is about . We'll discuss John Mackie's famous \"error theory\" concerning ethical thought and talk. Are moral facts just subjective, or do we have reason to think they must be objective? Today's slides are here . Readings Mackie, \"The Subjectivity of Value\" Reading Questions How does Mackie understand the notions of moral skepticism and subjectivism? How does Mackie understand the difference between \"first-order\" and \"second-order\" questions in ethics? What, according to Mackie, is characteristic of objectivity in ethics? What is Mackie's \"error theory\"? Why does he think the error theory is the best description of the nature of ethical judgment? Videos Crash course on meta-ethics Introduction to meta-ethics","tags":"assignments","title":"Class 21 - Ethics & Meta-Ethics"},{"url":"http://phil101.colinmclear.net/no-class.html","text":"No Lecture today. You have your regular sections this week though. See you Monday .","tags":"assignments","title":"No Class"},{"url":"http://phil101.colinmclear.net/class20-legal.html","text":"Today we'll discuss some objections to Libet's argument as well as some ramifications of our understanding of the neuroscience of action for legal views of responsibility. The slides from today can be found here . Readings Sinnott-Armstrong, Lessons from Libet Videos Free Will and Neuroscience: Revisiting Libet's Experiments","tags":"assignments","title":"Class 20 - Objections to Libet"},{"url":"http://phil101.colinmclear.net/Class19-libet.html","text":"Today we look at a famous set of experiments by Benjamin Libet purporting to show that we possess scientific evidence that we do not have free will, but at best \"free won't.\" Today's slides are here . Readings Libet, Do We Have Free Will? Videos The Libet Experiments","tags":"assignments","title":"Class 19 - Neuroscience & Free Will"},{"url":"http://phil101.colinmclear.net/class18-strawson.html","text":"Today we'll finish up our discussion of the source requirement, source incompatibilism, and Strawson's argument against the existence of moral responsibility and desert. Slides from today can be found here . Readings Strawson, The Impossiblity of Moral Responsibility Videos Strawson on the mystery of free will","tags":"assignments","title":"Class 18 - Strawson's Argument (Continued)"},{"url":"http://phil101.colinmclear.net/class17-control.html","text":"Today we'll review the discussion of leeway incompatibilism before moving to an alternative form of incompatibilism–source incompatibilism. We'll also start looking at one argument against the very coherence of the claim that we can be morally responsible for our actions at all. Slides from today's class are here . Readings Strawson, The Impossiblity of Moral Responsibility","tags":"assignments","title":"Class 17 - Free Will, Control, & Moral Responsibility"},{"url":"http://phil101.colinmclear.net/class16-pap.html","text":"Today we continue our discussion of free will. We will look at Harry Frankfurt's case of Jones, and whether free will really does require that one be able to do otherwise. Slides from today's class are here . Readings Frankfurt, Alternate Possibilities and Moral Responsibility Reading Questions What is the \"principle of alternate possibilities\" ( PAP )? How does Frankfurt's case concerning Jones affect our assessment of the importance of PAP ? Is free will necessary for moral responsibility? Is free will compatible with determinism?","tags":"assignments","title":"Class 16 - Free Will & Alternate Possibilities"},{"url":"http://phil101.colinmclear.net/class15-freewill.html","text":"Today we will start our discussion of the issues surrounding the question of free will. Are we free to act or are our actions causally determined by circumstances outside of our control? Today's slides can be found here . Readings Nagel, Free Will Reading Questions What is the connection between acting and the possibility of doing otherwise? What does Nagel mean when he talks about an action's being \"determined\"? What is the connection between acting freely and moral responsibility? Videos The problem of free will","tags":"assignments","title":"Class 15 - Free Will & Determinism"},{"url":"http://phil101.colinmclear.net/mid-term.html","text":"The mid-term is Wednesday. Please review the material we've covered up to this point. A good strategy for doing this would be to look at the reading questions and the slides from each assignment. Slides from Monday's overview are here . The clicker questions from the semester so far are here . See you Wednesday and good luck with your studying!","tags":"assignments","title":"Mid-Term"},{"url":"http://phil101.colinmclear.net/class14-review.html","text":"Today we'll review for the mid-term on Wednesday. Be sure to come prepared to ask questions!","tags":"assignments","title":"Class 14 - Mid-Term Review"},{"url":"http://phil101.colinmclear.net/class12-objections.html","text":"On Monday we talked about Searle's argument, or really, thought experiment, concerning the in-principle-impossibility of the strong artificial intelligence research program. Today we look at some objections to Searle's argument. Is it perhaps less convincing than it first seemed? You can find today's slides here . Readings Pryor, Searle's Chinese Room Reading Questions What is the difference between syntax and semantics? What is the \"systems objection\"? Is there a difference between the simulation of thought and actual thought? If so, what is it?","tags":"assignments","title":"Class 13 - Objections to the Chinese Room Argument"},{"url":"http://phil101.colinmclear.net/class12-chineseroom.html","text":"Today we will continue our discussion of the possibility of artificial intelligence and John Searle's argument against it. You might also want to try your hand at a Turing Test on the web . You can find today's slides here . Readings Searle, Is the brain's mind a computer program? Reading Questions What is the difference between \"weak\" and \"strong\" AI ? What is the \"Chinese room\"? Why does Searle think that the Chinese room lacks thought? Videos AI : Computers and Minds","tags":"assignments","title":"Class 12 - The Chinese Room Argument"},{"url":"http://phil101.colinmclear.net/class11-mind.html","text":"On Monday we discussed what a representation is, and why it might be the case that mental representation is the most fundamental kind (viz. because it is not conventionally determined and does not require interpretation). Today we'll start discussing the question of whether a machine could think. We'll look at one very famous test for machine thought (the \"Turing Test\") and one very famous objection to the claim that machines could think (the \"Chinese Room Argument\"). Today's slides can be found here . Readings Searle, Is the brain's mind a computer program? Reading Questions What model of the mind is Searle criticizing? What is the \"Turing Test\"? On what basis would Turing say that a machine can think?","tags":"assignments","title":"Class 11 - Representation & Mind"},{"url":"http://phil101.colinmclear.net/class10-representation.html","text":"Today we'll discuss the nature of representation, what forms such representation may take, and whether any particular form might be fundamental. We'll see why the notion of representation is important, and why it has also seemed so puzzling. Slides from today are here . Readings Crane, The Puzzle of Representation Reading Questions What is the puzzle of representation? In what ways does linguistic representation differ from pictorial representation? What kind(s) of representation does Crane think fundamental?","tags":"assignments","title":"Class 10 - The Puzzle of Representation"},{"url":"http://phil101.colinmclear.net/class9-block3.html","text":"Today we'll finish discussing Block and his criticisms of arguments for the function of consciousness based on cases of abnormal psychology. If there is time we will also start talking about the \"puzzle of representation\". Reading Block, On a Confusion about a Function of Consciousness see especially pp. 187-95 on criticism of the \"target reasoning\" Crane, The Puzzle of Representation Reading Questions On a confusion about consciousness What case does Block present for thinking that there could be access without phenomenal consciousness? What case does Block primarily focus on for thinking that there could be phenomenal without access consciousness? How does Block criticize the \"target reasoning\"? The puzzle of representation What is the puzzle of representation? In what ways does linguistic representation differ from pictorial representation? What kind(s) of representation does Crane think fundamental?","tags":"assignments","title":"Class 9 - Criticizing the \"Target Reasoning\""},{"url":"http://phil101.colinmclear.net/class8-block2.html","text":"Last week I introduced Block's distinction between access and phenomenal consciousness. Today we'll look at the distinction in greater depth and how this distinction affects what he calls the \"target reasoning\" in the scientific and philosophical investigation of consciousness. You can find today's slides here . Reading Block, On a Confusion about a Function of Consciousness see especially pp. 166-180 on the phenomenal/access distinction see especially pp. 187-95 on criticism of the \"target reasoning\"","tags":"assignments","title":"Class 8 - Access & Phenomenal Consciousness"},{"url":"http://phil101.colinmclear.net/class7-block.html","text":"Today we will talk more about what consciousness is. According to Ned Block, there are some central confusions in the way we think about consciousness, and which may be hindering its scientific study. You can find today's slides here. Reading Block, On a Confusion about a Function of Consciousness Reading Questions What is the ‘target reasoning' that Block is criticizing? What cases does Block discuss concerning access without phenomenal consciousness? What cases does Block discuss concerning phenomenal without access consciousness? Videos Block on consciousness Block on the mind-body problem","tags":"assignments","title":"Class 7 - Confusion about Consciousness"},{"url":"http://phil101.colinmclear.net/class6-lewis.html","text":"Last week we looked at one prominant argument against physicalism—-the \"Mary\" or \"knowledge\" argument. Today we discuss one prominant physicalist's response to the knowledge argument, that of David Lewis. You can find today's slides here . Readings Lewis, What Experience Teaches Reading Questions What is the \"hypothesis of phenomenal information\"? What is \"minimal materialism\"? What kind of argument (i.e. deductive, inductive, or abductive) does Lewis give against the truth of the knowledge argument? What is Lewis's alternative explanation of what changes about Mary when she leaves the black and white room?","tags":"assignments","title":"Class 6 - Lewis on What it is Like"},{"url":"http://phil101.colinmclear.net/class5-knowledge.html","text":"Today we'll discuss an alternative argument against the truth of physicalism. This argument centers on a famous \"thought experiment\" (we'll discuss what this means) of Frank Jackson's. You can find the slides for today's lecture here . Readings Jackson, Epiphenomenal Qualia Reading Questions What is the knowledge argument? Why is the conclusion to the knowledge argument a problem for physicalism? What is the modal argument? Why is the possibility of a phenomenal zombie a problem for physicalism? Videos Can science teach us everything?","tags":"assignments","title":"Class 5 - The Knowledge Argument"},{"url":"http://phil101.colinmclear.net/class4-nagel.html","text":"On Monday I introduced the \"hard problem\" of consciousness. Today we'll look at the specifics of Nagel's argument as to why the problem of consciousness is such a challenge for physicalism. You can find the slides for today here . Readings Review pages 442 and 445-7 of Nagel's paper Reading Questions Does Nagel think that it is impossible for physicalism to explain consciousness? How does Nagel conceive of objectivity? Of subjectivity? What is a \"point of view\" for Nagel? Explain what the phrase \"something it is like\" has to do with consciousness Videos Are we minds or bodies?","tags":"assignments","title":"Class 4 - Nagel's Argument"},{"url":"http://phil101.colinmclear.net/class3-physicalism.html","text":"Today we start discussion of physicalism — the claim that everything that does or could exist is physical. We'll look at some reasons for thinking that physicalism is true. We'll also discuss one area where physicalism might seem to run into trouble — namely, conscious thought and experience. You can find the slides for today's lecture here . Readings Nagel, What is it like to be a bat? Reading Questions In the course of your reading, think about how you might answer the following questions. What is physicalism? What is the significance of the experience of the bat for physicalism? What, according to Nagel, is the problem concerning consciousness and objectivity? Why is the problem of consciousness and objectivity a problem for physicalism? Videos Chalmers, The hard problem of consciousness","tags":"assignments","title":"Class 3 - Physicalism & Consciousness"},{"url":"http://phil101.colinmclear.net/class2-logic.html","text":"Today in class we'll continue discussing the basic features of an argument, including their basic logical structure. We'll look at some examples of the different forms an argument can take, and we will practice extracting an argument from a text. Readings What is an argument? Describing an argument Examples of good and bad argument forms Videos The following are some short videos covering many of the concepts discussed in the readings above, and which I'll cover again in lecture. The concepts of truth, validity, soundness, and deductive argument are central to all of the material we cover in this course, so it is important that you have a decent grip on them. Truth & Validity Deductive Arguments Validity Soundness You can find today's slides here .","tags":"assignments","title":"Class 2 - Logic & Argument"},{"url":"http://phil101.colinmclear.net/class1-philosophy.html","text":"Today we'll discuss some of the basic mechanics of the course. I'll provide an overview of the subject matter of philosophy and what we'll be talking about in the course. We'll also look at the basic features of philosophical method and argument. Here is a link to a video on critical thinking that will help give you some idea of the way in which philosophy constructs and evaluates arguments. For some helpful review of concepts and exercises concerning critical thinking and logic you can go here . You can find today's slides here .","tags":"assignments","title":"Class 1 - What is Philosophy?"}]}