{"pages":[{"url":"contact","text":"Dr. Colin McLear Office: 1003 Oldfather Hall Office Hours: T/R 12:30-1:30pm or by appointment Email: mclear@unl.edu Lauren Sweetland ( TA ) Office: 1023 Office Hours: Thursday 10:30-12:30pm Email: lauren.sweetland@huskers.unl.edu Email is the best way to reach me. I answer emails on weekdays, usually within 24 hrs. Students, please check your syllabus before emailing your question. If it is covered in the syllabus, I likely won't respond. If you would like a response, please adhere to these basic email etiquette guidelines: Remember to include your full name and course/section. Use a professional email address, such as your UNL email account, to send email, instead of an anonymous internet account. Using a UNL account also reduces the likelihood that your email will be mistaken for spam. Include an informative subject line that summarizes the content of your email (e.g. \"Question about Assignment 3 for PHIL101 ″ instead of \"Question\"). Begin your email with an appropriate greeting (Dear/Hi/Hello [professor's name]). Keep the body of your email brief and to the point. If it's longer than a paragraph, consider arranging a meeting during office hours to discuss your issue instead. Are you emailing with a question a classmate could answer (about material missed when absent, for example)? If so, ask that classmate before contacting your professor. It's more efficient for everyone. Do not send personal/confidential information in an email; email is not secure. Keep your tone professional. Write in complete sentences and avoid text-speak. Note: If your email looks like this: \"hi prof r we doing anything important 2day? kthxbai!\" you are unlikely to receive a reply. End your email with a closing (Best/Thank you/Sincerely/etc.) and your first and last name. Remember to leave time to receive a response. Do not expect a reply over the weekend or at 3 am, for example. Learning to communicate professionally is a critical skill that will help you in your future job searches and careers. Now is a good time to start practicing!","tags":"pages","title":"Contact"},{"url":"phil101.colinmclear.net","text":"This is the homepage for PHIL 101 — Introduction to Philosophy. The subject matter of philosophy traditionally concerns the articulation of \"big\" questions such as, \"Can we know anything?\"; \"What is real?\"; \"What kinds of things exist?\". Philosophers use rigorous and disciplined methods of thinking, in the hopes of bringing such questions under intellectual control. This course provides an in-depth look at a few specific topics, rather than a comprehensive survey of the field and its history. You will learn what philosophy is all about and how to do it yourself. If you'd like to take a look at the syllabus you can find it here: HTML | PDF","tags":"pages","title":"Welcome!"},{"url":"papers","text":"WRITE approximately 3-5 double-spaced pages on one of the following topics. For whatever topic you pick you must write it according to the format detailed below. The DUE DATE for the papers is: Friday, December 1 . Paper Structure EXPLAIN the argument (what are the premises? what is the conclusion?). You may present the argument in numbered form if you wish, though if you do so be sure to show the connection between the argument as you've explained it and the relevant text(s). ASSESS the argument for validity and soundness and explain why it is/isn't valid/sound. If there are problematic premises, then EXPLAIN how the author defends them. Is the argument for the conclusion CONVINCING ? WHY or why NOT ? For any topic you are free to draw on any concepts or readings we have discussed thus far, but be sure to answer the questions raised by the prompt. I expect papers to be clear . Write in short and complete sentences. Where necessary, sacrifice elegance in favor of clarity. Signpost heavily. Avoid needless generality or autobiographical reportage. Be sure to appropriately cite any sources which you consult in the writing of your paper. This includes sources which you do not directly quote! For further questions please consult the grading rubric . Be sure to review the linked guidelines on writing a thesis statement and paper structure ! Paper Topics In \"What is it like to be a bat\" Thomas Nagel argues that the nature of consciousness presents a challenge to our understanding of physicalism. What is Nagel's argument? What is the significance for physicalism of a \"point of view\" as Nagel understands it? Is Nagel's argument convincing? Why or why not? Explain the Knowledge Argument. What problem does it present for physicalism? What is the basic structure of Lewis's reply? Is his reply convincing? Provide reasons why or why not. Explain the free will problem. Why might free will and determinism be incompatible? What, if any reason do we have to think that they are compatible? Defend your position by providing reasons why or why not. Mackie argues that there are no objective values. Explain his arguments. Are they convincing? Provide reasons why or why not.","tags":"pages","title":"Paper Topics"},{"url":"resources","text":"Reading & Writing Philosophy Jim Pryor's guides to reading and writing philosophy Purdue Online Writing Lab A Guide to Philosophical Writing Writing a Thesis Statement Philosophy Paper Structure Philosophical Concepts & Background Critical Thinking Stanford Encyclopedia of Philosophy Internet Encyclopedia of Philosophy Philosophical Terms & Methods Other Materials iClicker registration REEF Polling Quickstart Guide REEF Troubleshooting Guide REEF Ovierview Video","tags":"pages","title":"Resources"},{"url":"schedule","text":"Week Date Topic 1 8/22 What is philosophy?; Intro to Logic 8/24 Logic & Argument 2 8/29 Physicalism & Consciousness 8/31 Nagel's Argument 3 9/5 The Knowledge Argument 9/7 Lewis against the Knowledge Argument 4 9/12 The Function of Consciousness 9/14 The Function of Consciousness (continued) 5 9/19 The Puzzle of Representation 9/21 Catch-up 6 9/26 Can Machines Think? 9/28 The Chinese Room Argument 7 10/3 Objections to the Chinese Room Argument 10/5 Mid-Term Review 8 10/10 No Class 10/12 Mid-Term 9 10/17 Fall Break (No Class) 10/19 Freedom & Determinism 10 10/24 Freedom & Alternate Possibilities 10/26 Determinism & Moral Responsibility 11 10/31 Determinism & Moral Responsibility (continued) 11/2 Free Will & Neuroscience 12 11/7 Free Will & Legal Responsibility 11/9 No Class 13 11/14 Ethics & Meta-Ethics 11/16 Two Kinds of Moral Skepticism 14 11/21 Moral Skepticism (continued) 11/23 Thanksgiving Break (No Class) 15 11/28 The Meaning of Life & Absurdity 11/30 The Absurd (continued); Papers due Friday 16 12/5 Meaning of Life (continued) 12/7 Exam Review 17 12/13 Final Exam 10:00 to 12:00 noon","tags":"pages","title":"Schedule"},{"url":"class3-physicalism.html","text":"Today we'll do two things. First, we'll finish our discussion of logic and the nature of argument. We'll look at some concrete examples and work through some texts. Second, we start discussion of physicalism — the claim that everything that does or could exist is physical. We'll look at some reasons for thinking that physicalism is true. We'll also discuss one area where physicalism might seem to run into trouble — namely, conscious thought and experience. Readings Nagel, What is it like to be a bat? Reading Questions In the course of your reading, think about how you might answer the following questions. What is physicalism? What is the significance of the experience of the bat for physicalism? What, according to Nagel, is the problem concerning consciousness and objectivity? Why is the problem of consciousness and objectivity a problem for physicalism? Videos Chalmers, The hard problem of consciousness","tags":"assignments","title":"Class 3 - Physicalism & Consciousness"},{"url":"class2-logic.html","text":"Today in class we'll continue discussing the basic features of an argument, including their basic logical structure. We'll look at some examples of the different forms an argument can take, and we will practice extracting an argument from a text. Readings What is an argument? Describing an argument Examples of good and bad argument forms Videos The following are some short videos covering many of the concepts discussed in the readings above, and which I'll cover again in lecture. The concepts of truth, validity, soundness, and deductive argument are central to all of the material we cover in this course, so it is important that you have a decent grip on them. Truth & Validity Deductive Arguments Validity Soundness You can find today's slides here .","tags":"assignments","title":"Class 2 - Logic & Argument"},{"url":"class1-philosophy.html","text":"Today we'll discuss some of the basic mechanics of the course. I'll provide an overview of the subject matter of philosophy and what we'll be talking about in the course. We'll also look at the basic features of philosophical method and argument. Here is a link to a video on critical thinking that will help give you some idea of the way in which philosophy constructs and evaluates arguments. For some helpful discussion of concepts and exercises concerning critical thinking and logic you can go here . You can find today's slides here .","tags":"assignments","title":"Class 1 - What is Philosophy?"}]}